OpenNuvoton/M0564BSP/SampleCode/StdDriver/USCI_I2C_Monitor/main.c
    /* I2C as master sends START signal */
    I2C_SET_CONTROL_REG(I2C0, I2C_CTL_STA);

    /* Wait I2C Tx Finish */
    while(g_u8EndFlagM == 0);
    g_u8EndFlagM = 0;

    /* I2C function to read data from slave */
    s_I2C0HandlerFn = (I2C_FUNC)I2C_MasterRx;

    g_u8MstDataLen = 0;
    g_u8DeviceAddr = slvaddr;

    I2C_SET_CONTROL_REG(I2C0, I2C_CTL_STA);

    /* Wait I2C Rx Finish */
    while(g_u8EndFlagM == 0);
    while(g_u32ProtOn);


    return 0;
}




int32_t UI2C_Monitor_7bit_test()
{
    int32_t err = 0;
    uint32_t i;


    //USCI1 be a Slave
    s_Event = SLAVE_ADDRESS_ACK;


#if SCLOUT_ENABLE
    UI2C1->PROTCTL |= (UI2C_PROTCTL_MONEN_Msk | UI2C_PROTCTL_SCLOUTEN_Msk);
#else
    UI2C1->PROTCTL |= UI2C_PROTCTL_MONEN_Msk;
#endif
    UI2C_SET_CONTROL_REG(UI2C1, UI2C_CTL_AA);
    for(i = 0; i < 0x100; i++)
    {
        g_u8SlvData[i] = 0;
    }
    g_u32ProtOn = 0;
    g_u8MonRcvEveryThing = 0;


    /* I2C function to Slave receive/transmit data */
    s_UI2C1HandlerFn = UI2C_SLV_7bit_Monitor;
    DbgPrintf("I2C1 Slave Mode is Running.\n");

#if I2C_ENABLE
    I2C1_Init();
    /* I2C1 enter no address SLV mode */
    I2C_SET_CONTROL_REG(I2C1, I2C_CTL_SI_AA);
    for(i = 0; i < 0x100; i++)
    {
        g_u8SlvData[i] = 0;
    }
    /* I2C function to Slave receive/transmit data */
    s_I2C1HandlerFn = I2C_SlaveTRx_7bit_1;

    /* I2C IP as Master */
    I2C0_Init();

    err = Read_Write_SLAVE_Mon(MONITOR_ADDR);
#endif

    printf("\nDump Monitor data: \n");
    for(i = 0; i<(I2C_DATA_MAX+1); i++)
    {
        if(i == 0)
            printf("Monitor address: [0x%X]", g_u8MonRecData[i]>>1);
        else
            printf("[0x%X]\t", g_u8MonRecData[i]);

        if(i % 8 == 0)
            printf("\n");
    }
    printf("\n\n");



    for(i = 0; i<I2C_DATA_MAX; i++)
        g_u8MonRecData[i] = 0;

    return err;
}




int main()
{
    /* Unlock protected registers */
    SYS_UnlockReg();
    /* Init System, IP clock and multi-function I/O. */
    SYS_Init();
    /* Lock protected registers */
    SYS_LockReg();

    /* Init UART for print message */
    UART_Open(UART0, 115200);

    /*
        This sample code sets USCI_I2C bus clock to 100kHz. Then, Master accesses Slave with Byte Write
        and Byte Read operations, and check if the read data is equal to the programmed data.
    */

    printf("+-------------------------------------------------------+\n");
    printf("|  USCI_I2C Driver Sample Code for Master access        |\n");
    printf("|  7-bit Monitor mode test                              |\n");
    printf("|  UI2C0(Master)  <----> UI2C1(Slave)                   |\n");
    printf("+-------------------------------------------------------+\n");

    printf("\n");
    printf("Configure UI2C0 as a master, UI2C1 as Slave.\n");
    printf("The I/O connection for UI2C0:\n");
    printf("UI2C0_SDA(PC.5), UI2C0_SCL(PC.4)\n");
    printf("UI2C1_SDA(PD.14), UI2C1_SCL(PD.15)\n");
    printf("\n");
    printf("Configure I2C0 as Master, and I2C1 as a slave.\n");
    printf("The I/O connection I2C0 to I2C1:\n");
    printf("I2C0_SDA(PD.4), I2C0_SCL(PD.5)\n");
    printf("I2C1_SDA(PE.5), I2C1_SCL(PE.4)\n\n");

    /* Init USCI_I2C0 and USCI_I2C1 */
    UI2C0_Init(100000);
    UI2C1_Init(100000);


    s_Event = SLAVE_ADDRESS_ACK;

    UI2C_SET_CONTROL_REG(UI2C1, (UI2C_CTL_PTRG | UI2C_CTL_AA));

    while(1)
    {
        printf("Monitor test ....\n");
        UI2C_Monitor_7bit_test();
        printf("Press any key to continue\n");
        getchar();
    }

}

/*** (C) COPYRIGHT 2016 Nuvoton Technology Corp. ***/
